Autodesk.Revit.VSTA.ApplicationEntryPoint.MacroUpdated
MacroUpdated.
Remarks:
This event is raised after macro modules were updated.
Since:
2025

Autodesk.Revit.VSTA.ApplicationEntryPoint.ProjectVisibilityOptionsChanged
Subscribe to the ProjectVisibilityOptionsChanged event to be notified after the project visibility options were changed.
Remarks:
This event is raised after the project visibility options were changed.
Since:
2025

Autodesk.Revit.VSTA.ApplicationEntryPoint.RecentPinStatusChanged
Subscribe to the RecentPinStatusChanged event to be notified after the pin status changed.
Remarks:
This event is raised after the pin status changed.
Since:
2025

Autodesk.Revit.VSTA.ApplicationEntryPoint.UserInterfaceOptionsChanged
Subscribe to the UserInterfaceOptionsChanged event to be notified after the user interface options were changed.
Remarks:
This event is raised after the user interface options were changed.
Since:
2025

Autodesk.Revit.VSTA.ApplicationEntryPoint.ThemeChanged
Subscribe to the ThemeChanged event to be notified after the theme was changed.
Remarks:
This event is raised after the theme was changed.
Since:
2024

Autodesk.Revit.VSTA.ApplicationEntryPoint.SelectionChanged
Subscribe to the SelectionChanged event to be notified after the selection was changed.
Remarks:
This event is raised after the selection was changed in the current document.
Handlers of this event are forbidden to make modifications to the current document.
Handlers of this event are forbidden to change the selection to the current document.
It is not allowed to open a new transaction in the active document when handling this event.
Since:
2023

Autodesk.Revit.VSTA.ApplicationEntryPoint.TransferredProjectStandards
Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized.
Remarks:
This event is raised just after the native Revit items have been transferred, but before the transaction has been committed.
An add-in that registered external items in Autodesk.Revit.UI.UIApplication.TransferringProjectStandards should subscribe to this event to carry out the transfer of any items that it registered if the user enabled those items for transfer.
During the scope of this event, modification is permitted to the target document and modification is not permitted to the source document.
Since:
2017.2

Autodesk.Revit.VSTA.ApplicationEntryPoint.TransferringProjectStandards
Subscribe to the TransferringProjectStandards event to be notified before the scope of an impending Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog.
Remarks:
This event allows an external application to add additional items to the possible list of items to be transferred.
These items will be visible and selectable in the Transfer Project Standards dialog box. By default, new items added in this manner will be enabled for transfer.
During the scope of this event, modification is not permitted to either the source or target documents. And this event is not cancellable.
Since:
2017.2

Autodesk.Revit.VSTA.ApplicationEntryPoint.ExternalDataManagerChanged
Subscribe to ExternalDataManager changed event to be notified.
Remarks:
This event is raised when ExternalDataManager dialog changed.
Since:
2026

Autodesk.Revit.VSTA.ApplicationEntryPoint.FabricationPartBrowserChanged
Subscribe to MEP Fabrication part browser changed event to be notified when MEP Fabrication part browser is updated.
Remarks:
More docs about the different conditions goes here
Since:
2017

Autodesk.Revit.VSTA.ApplicationEntryPoint.DockableFrameFocusChanged
Subscribe to this event to be notified when a Revit GenericDockableFrame has gained focus or lost focus in the Revit user interface.
This event is called only for API-created GenericDockableFrames.
Remarks:
This event is raised when the GenericDockableFrame is just about to be active or inactive.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
No document may be modified at the time of the event.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()All overloads of Autodesk.Revit.DB.Document.Import()Autodesk::Revit::DB::Document::PrintAutodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save and similar overloads.Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2015

Autodesk.Revit.VSTA.ApplicationEntryPoint.DockableFrameVisibilityChanged
Subscribe to this event to be notified when a Revit GenericDockableFrame has been shown or hidden in the Revit user interface.
This event is called only for API-created GenericDockableFrames.
Remarks:
This event is raised when the GenericDockableFrame is just about to be shown or hidden.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
No document may be modified at the time of the event.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()All overloads of Autodesk.Revit.DB.Document.Import()Autodesk::Revit::DB::Document::PrintAutodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save and similar overloads.Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2015

Autodesk.Revit.VSTA.ApplicationEntryPoint.DisplayingOptionsDialog
Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
Since:
2013

Autodesk.Revit.VSTA.ApplicationEntryPoint.ApplicationClosing
Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
Remarks:
This event is raised when the Revit application is just about to be closed.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
No document may be modified at the time of the event.
The sender object of this event is Autodesk.Revit.UI.UIControlledApplication object.
Since:
2010

Autodesk.Revit.VSTA.ApplicationEntryPoint.Idling
Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction.
Remarks:
This event is raised when it is safe for the API application to access the active
document between user interactions. The event is raised only when the Revit UI is
in a state where the user could successfully click on an API command button.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
In order to change a document, you must begin a new transaction for that document.
This transaction will appear in the Revit undo stack and may be undone by the Revit user.
This event is invoked between user actions in the Revit UI. If the handler for
this event requires a significant amount of processing time, users will perceive a slowdown
in the responsiveness of Revit. If the execution for updates can be safely split across
multiple calls to this event, the user perception of Revit responsiveness will be improved.
There are two ways to use this event.  In the default mode, a single raise of the event
will be made each time Revit begins an idle session.  Note that when the user is active in the Revit
user interface, idle sessions begin whenever the mouse stops moving for a moment or when a
command completes.  However, if the user is not active in the user interface at all, Revit may not invoke
additional idling sessions for quite some time; this means that your application may not be able to take advantage
of time when the user leaves the machine completely for a period of time.
In the non-default mode, your application forces Revit to keep the idling session open and to make
repeated calls to your event subscriber.  In this mode even if the user is totally inactive the Revit
session will continue to make Idling calls to your application.  However, this can result in performance
degradation for the system on which Revit is running because the CPU remains fully engaged in serving Idling
events during the Revit application's downtime.
You can indicate the preference for the non-default Idling frequency by calling
Autodesk.Revit.UI.Events.IdlingEventArgs.SetRaiseWithoutDelay
each time the Idling event callback is made.  Revit will revert to the default Idling frequency
if this method is not called every time in your callback.
Event is not cancellable.
Since:
2010

Autodesk.Revit.VSTA.ApplicationEntryPoint.FormulaEditing
Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.

Autodesk.Revit.VSTA.ApplicationEntryPoint.DialogBoxShowing
Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box.
Remarks:
This event is raised when Revit is just about to show a dialog box or a message box.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
Depending on the type of the dialog that is being shown, the event's argument's type varies as follows:
When it is a dialog box, the event's argument is an object of Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.
When it is a message box, the event's argument is an object of Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs,which is subclass of DialogBoxShowingEventArgs.
When it is a task dialog, the event's argument is an object of Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs,which is subclass of DialogBoxShowingEventArgs.
No document may be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save and similar overloads.Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.VSTA.ApplicationEntryPoint.ViewActivated
Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document.
Remarks:
This event is raised immediately after Revit has finished activating a view of the document.
It is raised even when view activating failed or was cancelled (during ViewActivating event).
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of view activating has already been finished.
The document may be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save and similar overloads.Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.VSTA.ApplicationEntryPoint.ViewActivating
Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document.
Remarks:
This event is raised when Revit is just about to activate a view of the document.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document may be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save and similar overloads.Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above
methods is called during this event.
Another Autodesk.Revit.UI.UIApplication.ViewActivated event will be raised immediately after view
activating is finished.
Since:
2010

Autodesk.Revit.VSTA.ApplicationEntryPoint.UpdateWorksharingActivityIndicator(System.Boolean,System.Collections.Generic.IList{System.String})
Updates model status on the Worksharing activity indicator.
Remarks:
The indicator is enabled only when the active document is cloud Worksharing.
centralIsBusy:
True if the central model is busy.
syncingUsernames:
An array with the usernames of the users which are currently syncing
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020.1

Autodesk.Revit.VSTA.ApplicationEntryPoint.UpdateWorksharingActivityIndicator(System.Boolean)
Updates model status on the Worksharing activity indicator.
Remarks:
The indicator is enabled only when the active document is cloud Worksharing.
centralIsBusy:
True if the central model is busy.
Since:
2019.1

Autodesk.Revit.VSTA.ApplicationEntryPoint.OpenAndActivateDocumentOperationInternal(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.IOpenFromCloudCallback)
Opens and activates a Revit document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.VSTA.ApplicationEntryPoint.OpenAndActivateDocument(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions,System.Boolean,Autodesk.Revit.DB.IOpenFromCloudCallback)
Opens and activates a Revit document, include both local document or cloud document.
Remarks:
This method, if successful, changes the active document.
It is not allowed to have an open transaction in the active document when calling this method.
Consequently, this method can only be used in manual transaction mode, not in automatic mode.
Additionally, this method may not be called from inside an event handler.
modelPath:
A path to a Revit file to be opened.
The file can be either a Revit project, template, or family document.
openOptions:
Options for opening the file.
detachAndPrompt:
True means if openOptions specifies DoNotDetach,
then for workshared models detach from central and query the user whether to preserve or discard worksets.
make no sense when opening a cloud document.
openFromCloudCallback:
Callback function that allow caller to handle cases when conflicts happen during opening a cloud document.
Make no sense when opening a non-cloud document.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
If DetachFromCentralOption is not DoNotDetach when opening a cloud document.
If the active document is currently modifiable.If an API event handler is currently being executed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'modelPath'.
-or-
If null is passed as 'openOptions'.
-or-
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Thrown when file is not found at the give path.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
When file cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
when file has an invalid extension. Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file specified by 'modelPath' cannot be found or the given 'modelPath' is not a Revit file (a project, template, or family document).
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The cloud model is not saved in current release of Revit.
-or-
The model is not allowed to access.
-or-
The document can not be opened.Open is temporarily disabled.Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
If there is any server internal error.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id when trying to open a cloud model.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2019

Autodesk.Revit.VSTA.ApplicationEntryPoint.OpenAndActivateDocument(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions,System.Boolean)
Opens and activates a Revit document, include both local document or cloud document.
Remarks:
This method, if successful, changes the active document.
The model will override the local change with the latest change if it is a cloud model and it was restored, or relinquished, or out of date.
It is not allowed to have an open transaction in the active document when calling this method.
Consequently, this method can only be used in manual transaction mode, not in automatic mode.
Additionally, this method may not be called from inside an event handler.
modelPath:
A path to a Revit file to be opened.
The file can be either a Revit project, template, or family document.
openOptions:
Options for opening the file.
detachAndPrompt:
True means if openOptions specifies DoNotDetach,
then for workshared models detach from central and query the user whether to preserve or discard worksets.
make no sense when opening a cloud document.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
If DetachFromCentralOption is not DoNotDetach when opening a cloud document.
If the active document is currently modifiable.If an API event handler is currently being executed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'modelPath'.
-or-
If null is passed as 'openOptions'.
-or-
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Thrown when file is not found at the give path.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
When file cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
when file has an invalid extension. Try changing the file's extension and opening it again.
when file was saved by an application that was not developed or licensed by Autodesk.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file specified by 'modelPath' cannot be found or the given 'modelPath' is not a Revit file (a project, template, or family document).
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The cloud model is not saved in current release of Revit.
-or-
The model is not allowed to access.
-or-
The document can not be opened.Open is temporarily disabled.Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
If there is any server internal error.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id when trying to open a cloud model.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.ServerModelCorruptedException:
The central model is corrupted.
This exception is treated starting from Revit 2025.2.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2013

Autodesk.Revit.VSTA.ApplicationEntryPoint.OpenAndActivateDocument(System.String)
Opens and activates a Revit document.
Remarks:
This method, if successful, changes the active document.
It is not allowed to have an open transaction in the active document when calling this method.
Additionally, this method may not be called from inside an event handler.
fileName:
A full path to a revit file to be opened.
The file can be either a Revit project, template, or family document.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given 'fileName' is not a Revit file (a project, template, or family document).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'fileName'.
-or-
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file specified by 'fileName' cannot be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If the active document is currently modifiable.
If an API event handler is currently being executed.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
If there is any server internal error.
Since:
2012

Autodesk.Revit.VSTA.ApplicationEntryPoint.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.VSTA.ApplicationEntryPoint.IsViewerModeActive
Determines if Revit session is in Viewer mode.
Since:
2019.1

Autodesk.Revit.VSTA.ApplicationEntryPoint.Application
Returns the database level Application represented by this UI level Application.

Autodesk.Revit.VSTA.ApplicationEntryPoint.OpenRecentFileOnRevitHome(Autodesk.Revit.DB.ModelPath)
Open a recent model on revit home.

Autodesk.Revit.VSTA.ApplicationEntryPoint.MainWindowHandle
Get the handle of the Revit main window.
Remarks: Returns the main window handle of the Revit application. This handle should be used when displaying
modal dialogs and message windows to insure that they are properly parented. This property replaces
System.Diagnostics.Process.GetCurrentProcess().MainWindowHandle property, which is no longer a reliable
method of retrieving the main window handle starting with Revit 2019.
Since: 2019

Autodesk.Revit.VSTA.ApplicationEntryPoint.RegisterContextMenu(System.String,Autodesk.Revit.UI.IContextMenuCreator)
Adds a new context menu creator.
fullClassName: FullClassName of the application.
creator: Your add-in's implementation of the IContextMenuCreator interface.
Remarks: For details about the use of IContextMenuCreator, see Autodesk.Revit.UI.IContextMenuCreator.
Since: 2025

Autodesk.Revit.VSTA.ApplicationEntryPoint.RegisterDockablePane(Autodesk.Revit.UI.DockablePaneId,System.String,Autodesk.Revit.UI.IDockablePaneProvider)
Adds a new dockable pane to the Revit user interface.
id: Unique identifier for the new pane.
title: String to use for the pane caption.
provider: Your add-in's implementation of the IDockablePaneProvider interface.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if a dockable pane with identifier %id% has already been registered.
Since: 2014

Autodesk.Revit.VSTA.ApplicationEntryPoint.ProductIsRS
Identifies if the current Revit product has an RS designation.  Most add-ins will not need to use this information.
Since: 2019

Autodesk.Revit.VSTA.ApplicationEntryPoint.GetDockablePane(Autodesk.Revit.UI.DockablePaneId)
Gets a DockablePane object by its ID.
id: Unique identifier for the new pane.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if no dockable pane has been registered with identifier %id%.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the dockable pane with identifier %id% has not been created yet.
Since: 2014

Autodesk.Revit.VSTA.ApplicationEntryPoint.LoadPackageContents(System.String)
Loads add-ins from the given packageContents.xml file.
packageContentsPath: The name of package contents file
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException: Thrown when manifest file which is specified by
packageContentsPath doesn't exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown if the add-in file path specified by
packageContentsPath is null, Or packageContentsPath is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the add-in specified by packageContentsPath doesn't
end with 'addin' or packageContentsPath is a zero-length string.
Throws Autodesk.Revit.Exceptions.FileNotFoundException: Thrown if the packageContentsPath is not found.
Throws Autodesk.Revit.Exceptions.ApplicationException: Thrown if the manifest file specified by packageContentsPath
can't be parsed successfully.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when any of the newly added external
applications fails to load and/or initialize properly, possibly because of one of the following reasons:
AllowLoadingIntoExistingSession property is 'No'.Client id is duplicated.External application start up failed.
Throws Autodesk.Revit.Exceptions.InternalException: Thrown if packageContentsPath file that was found could not
be loaded.
Since: 2014

Autodesk.Revit.VSTA.ApplicationEntryPoint.LoadAddIn(System.String)
Loads add-ins from the given manifest file.
Remarks:
This method loads the add-ins listed in the provided add-in manifest file.
The API will look for the file in the dedicated folders supported by Revit for loading add-in manifest files.
Some add-ins may have settings in which they decline the ability for Revit to load the external application declared
in the .addin in mid-session.
This happens when the AllowLoadingIntoExistingSession tag is set to "No" in the add-in manifest file, and if the tag
isn't present, the default is set to "Yes".
Note that when Revit starts an add-in in the middle of the session, some add-in logic may not function as expected
because of the different interactions with the session.  Specifically:
If the application's goal is to prevent something from happening, the application may not be able to handle
the fact that this activity has already happened in the existing session. If the application's goal is to manage external information in synch with documents loaded in the session,
the application may not be able to handle documents that were loaded before the application started. If the application's logic depends on the ApplicationInitialized event, this event has already been called
before the add-in was loaded.
Also, some add-ins may not be able to fully initialize when loading in the middle of the session.  This is because some
activities must take place at the start of the Revit session:
Creation of custom failure definitionsEstablishment of a system-wide IFailureProcessor to handle all failures.Registering ExternalServices.
fileName: The name of the add-in manifest file including the extension is to identify the
manifest file which contains Revit add-ins.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException: Thrown when manifest file which is specified by
fileName doesn't exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown if the fileName is null or empty.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the fileName doesn't end with 'addin'.
Throws Autodesk.Revit.Exceptions.ApplicationException: Thrown if the manifest file can't be parsed successfully.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when any of the newly added external
applications fails to load and/or initialize properly, possibly because of one of the following reasons:
AllowLoadingIntoExistingSession property is 'No'.Client id is duplicated.External application start up failed.
Since: 2014

Autodesk.Revit.VSTA.ApplicationEntryPoint.RemoveAddInCommandBinding(Autodesk.Revit.UI.RevitCommandId)
Removes an AddInCommandBinding.
revitCommandId: The Revit command id to identify the command handler you want to remove the binding.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when uiApplication or revitCommandId
is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the given command is not bound with this add-in.
Since: 2013

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateAddInCommandBinding(Autodesk.Revit.UI.RevitCommandId)
Creates a new AddInCommandBinding.
revitCommandId: The Revit command id to identify the command handler you want to replace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when uiApplication or revitCommandId
is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the given command already has been bound.
Since: 2013

Autodesk.Revit.VSTA.ApplicationEntryPoint.ActiveAddInId
Get current active external application or external command id.

Autodesk.Revit.VSTA.ApplicationEntryPoint.LoadedApplications
Returns an array of successfully loaded external applications.
Remarks:  This property can be used by your application to find all successfully
loaded external applications when Revit starts.

Autodesk.Revit.VSTA.ApplicationEntryPoint.GetRibbonPanels(System.String)
Get all the custom Panels on a designated Revit tab.
tabName: The name of the tab on which the panels are located.
Remarks:  Built-in panels will not be included. tabName must be the name of one of the tabs added
by Autodesk.Revit.UI.UIApplication.CreateRibbonTab(System.String).
This method is not supported in Macros.

Autodesk.Revit.VSTA.ApplicationEntryPoint.GetRibbonPanels(Autodesk.Revit.UI.Tab)
Get all the custom Panels on a designated standard Revit tab.
tab: The tab on which the panels are located.
Remarks:  Built-in panels will not be included. This method is not supported in Macros.

Autodesk.Revit.VSTA.ApplicationEntryPoint.GetRibbonPanels
Get all the custom Panels on Add-Ins tab of Revit.
Remarks:  The built-in panels won't be included and the panels added to tabs other than Add-Ins will not be included.
This method is not supported in Macros.

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateRibbonPanel(Autodesk.Revit.UI.Tab,System.String)
Create a new RibbonPanel on the designated standard Revit tab.
tab: The target tab, on which the new panel will be created.
panelName: The name of the panel to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: panelName is Empty or the tab is not valid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If more than 100 panels were created or the tab cannot be found.
Remarks:  This method will create a custom panel appending to the specified tab. This method is not supported in Macros.

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateRibbonPanel(System.String)
Create a new RibbonPanel on the Add-Ins tab.
panelName: The name of the panel to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: panelName is Empty.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If more than 100 panels were created.
Remarks:  This method will create a custom panel appending to the Revit AddIns tab. This method is not supported in Macros.

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateRibbonPanel(System.String,System.String)
Create a new RibbonPanel on the specified tab.
tabName: The name of the tab, on which the new panel will be created.
panelName: The name of the panel to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: tabName or panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: tabName or panelName is Empty.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Too many panels have been added to this tab (Maximum is 100).
Remarks:  This method will create a custom panel appending to the specified tab. This method is not supported in Macros.

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateRibbonTab(System.String)
This fils contails the Ribbons related methods which may need to be overrideed in subclasses.
Creates a new tab on the Revit user interface.
tabName: The name of the tab to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: tabName or panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: tabName or panelName is Empty or the tab name duplicates the name of another tab in the Revit UI.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Too many custom tabs have been created in this session. (Maximum is 20).
Remarks:  This method will create a custom tab at the end of the list of static tabs. If multiple tabs are added, they will be shown in the order added. This method is not supported in Macros.

Autodesk.Revit.VSTA.ApplicationEntryPoint.PostCommand(Autodesk.Revit.UI.RevitCommandId)
Posts the command to the Revit message queue to be invoked when control returns from the current API context.
commandId:  The command Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when commandId is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: If the command cannot be posted.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If there is a command already been posted.
Since:
2014

Autodesk.Revit.VSTA.ApplicationEntryPoint.CanPostCommand(Autodesk.Revit.UI.RevitCommandId)
Identifies if the given command can be posted, using Autodesk.Revit.UI.UIApplication.PostCommand(Autodesk.Revit.UI.RevitCommandId).
commandId:  The command Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when commandId is null.
Remarks:  Only members of Autodesk.Revit.UI.PostableCommand or external commands can be posted.
Since:
2014

Autodesk.Revit.VSTA.ApplicationEntryPoint.DoDragDrop(System.Object,Autodesk.Revit.UI.IDropHandler)
Initiates a drag and drop operation with a custom drop implementation.
dropData: Any arbitrary data to be passed to the drop handler when the drop occurs.
handler: The handler to be executed when the drop occurs.
Remarks:  When the user inputs IControllableDropHandler,
it allows the handler to verify whether the drop event can be executed on the given view;
When the user inputs IDropHandler
the handler will be executed without any condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when dropData or handler is null.
Since:
2013

Autodesk.Revit.VSTA.ApplicationEntryPoint.DoDragDrop(System.Collections.Generic.ICollection{System.String})
Initiates a drag and drop operation of a collection of file names on the Revit user interface.
Remarks: The behavior after the 'dragData' dragged onto Revit is listed bellow:
Only one AutoCAD format or image file dragged onto Revit: a new import placement editor will be started for import the file;  More than one AutoCAD format or image files dragged onto Revit: a new import placement editor will be started only for the first AutoCAD format or image file;  Only one family file dragged onto Revit: the family will be loaded, and an editor will be started to place the family; More than one family files dragged onto Revit: all the families will be loaded; More than one family files including other format files dragged onto Revit: Revit will try to open all the files; If a valid file or list of files is passed, Revit will do its best to use them appropriately. If any files are not usable, failure will be signalled to the interactive Revit user (and will not be signalled to the application with an exception).
dropData: The list of file paths and names.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when dropData is null.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException: Thrown when dropData contains a file that doens't exist.
Since:
2013

Autodesk.Revit.VSTA.ApplicationEntryPoint.DrawingAreaExtents
Get the rectangle that represents the screen pixel coordinates of drawing area.
Remarks: The drawing area of the Revit window displays views (and sheets and schedules) of projects.
The size of drawing area restricts the max size of the view titles and windows, the value may be empty if modal browser is opened.
If there is no project opened, null will be returned.
Since: 2011

Autodesk.Revit.VSTA.ApplicationEntryPoint.MainWindowExtents
Get the rectangle that represents the screen pixel coordinates of the Revit main window.
Since: 2011

Autodesk.Revit.VSTA.ApplicationEntryPoint.ActiveUIDocument
Provides access to an object that represents the currently active project.
Remarks: External API commands can access this property in read-only mode only!
The ability to modify the property is reserved for future implementations.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when attempting to modify the property.

Autodesk.Revit.VSTA.ApplicationEntryPoint.#ctor(Autodesk.Revit.ApplicationServices.Application)
Use a database level Application to construct a UI-level Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the Application argument is a null pointer.

Autodesk.Revit.VSTA.ApplicationEntryPoint.#ctor(Autodesk.Revit.ApplicationServices.ControlledApplication)
Use a database level Application to construct a UI-level Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the Application argument is a null pointer.